In [2]:
import numpy as np
import pandas
import matplotllib

In [6]:
df = pandas.read_csv('http://13.234.66.67/summer19/datasets/com.csv')
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [9]:
df['Salary'].min()

50

In [11]:
df['Salary'].sum()

750

In [13]:
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64